sbhakim/IoT_with_nRF52/lab_7_ble_hts_SDK11/main.c
static uint16_t                          m_conn_handle = BLE_CONN_HANDLE_INVALID;   /**< Handle of the current connection. */

/* YOUR_JOB: Declare all services structure your application is using
static ble_xx_service_t                     m_xxs;
static ble_yy_service_t                     m_yys;
*/

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}}; /**< Universally unique service identifiers. */

                                   
/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers.

    /* YOUR_JOB: Create any timers to be used by the application.
                 Below is an example of how to create a timer.
                 For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
                 one.
    uint32_t err_code;
    err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
    APP_ERROR_CHECK(err_code); */
}

/* ------------ added_by_safayat -------------------- */


/*
* Function for generating a dummy temperature information packet.
*/
static void generate_temperature(ble_hts_meas_t * p_meas)
{
    static ble_date_time_t time_stamp = { 2017, 15, 11, 16, 15, 0 };

    uint32_t celciusX100;

    p_meas->temp_in_fahr_units = false;
    p_meas->time_stamp_present = true;
    p_meas->temp_type_present = (TEMP_TYPE_AS_CHARACTERISTIC ? false : true);
    celciusX100 = 2000+hts_counter++; // one unit is 0.01 Celcius
    p_meas->temp_in_celcius.exponent = -2;
    p_meas->temp_in_celcius.mantissa = celciusX100;
    p_meas->temp_in_fahr.exponent = -2;
    p_meas->temp_in_fahr.mantissa = (32 * 100) + ((celciusX100 * 9) / 5);
    p_meas->time_stamp = time_stamp;
    p_meas->temp_type = BLE_HTS_TEMP_TYPE_FINGER;
    // update simulated time stamp
 
       time_stamp.seconds += 27;
    if (time_stamp.seconds > 59)
     {
        time_stamp.seconds -= 60;
        time_stamp.minutes++;
         if (time_stamp.minutes > 59)
         {
             time_stamp.minutes = 0;
        }
    }
}

/* ------------ added_by_safayat -------------------- */


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
    APP_ERROR_CHECK(err_code); */

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the YYY Service events. 
 * YOUR_JOB implement a service handler function depending on the event the service you are using can generate
 *
 * @details This function will be called for all YY Service events which are passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 *
static void on_yys_evt(ble_yy_service_t     * p_yy_service, 
                       ble_yy_service_evt_t * p_evt)
{
    switch (p_evt->evt_type)
    {
        case BLE_YY_NAME_EVT_WRITE:
            APPL_LOG("[APPL]: charact written with value %s. \r\n", p_evt->params.char_xx.value.p_str);
            break;
        
        default:
            // No implementation needed.
            break;
    }
}*/




/* ------------ added_by_safayat -------------------- */

static void temperature_measurement_send(void)
{
 ble_hts_meas_t hts_meas; //Health Thermometer Service measurement structure
 ret_code_t err_code;
    if (!m_hts_meas_ind_conf_pending)
    {
        generate_temperature(&hts_meas);

        err_code = ble_hts_measurement_send(&m_hts, &hts_meas);
        
        switch (err_code)
        {
             case NRF_SUCCESS:
             // Measurement was successfully sent, wait for confirmation.
                 m_hts_meas_ind_conf_pending = true;
                 break;
            
             case NRF_ERROR_INVALID_STATE:
            // Ignore error.
                break;
            
            default:
                APP_ERROR_HANDLER(err_code);
                break;
         }
    }
}


/*
* Function for handling the Health Thermometer Service events.
*/
static void on_hts_evt(ble_hts_t * p_hts, ble_hts_evt_t * p_evt)
{
     switch (p_evt->evt_type)
    {
        case BLE_HTS_EVT_INDICATION_ENABLED:
            // Indication has been enabled, send a single temperature measurement
            temperature_measurement_send();
            break;
        case BLE_HTS_EVT_INDICATION_CONFIRMED:
            m_hts_meas_ind_conf_pending = false;
            break;
        default:
            // No implementation needed.
            break;
     }
}


/* ------------ added_by_safayat -------------------- */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
   
